app/controllers/comments_controller.rb

SELECT * FROM "comments"
---
  def index
    @comments = Comment.all

SELECT * FROM "comments" WHERE ("comments"."id" = 8)
---
  def edit
    @comment = Comment.find(params[:id])

SELECT * FROM "posts" WHERE ("posts"."id" = 13)
SELECT * FROM "users" WHERE ("users"."id" = 0)
INSERT INTO "comments" ("updated_at", "body", "post_id", "user_id", "user_name", "created_at") VALUES('2009-10-08 19:16:23', 'This is a comment from Chris', NULL, 1, NULL, '2009-10-08 19:16:23')
---
  def create
    @post = Post.find(params[:post_id])

    if session[:user_id] == 18796
      @comment = @post.comments.new(params[:comment])
    else
      @user = User.find(session[:user_id])
      @comment = @post.comments.new(params[:comment].merge :user_id => @user.id)
  end

    #@comment = current_user.comments.create(params[:comment])

  #@comment.user_id = session[:user_id]
  #@comment.user.name = @user.name

    if @comment.save

SELECT * FROM "comments" WHERE ("comments"."id" = 8)
---
  def update
    @comment = Comment.find(params[:id])