app/controllers/posts_controller.rb

SELECT * FROM "posts" ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "posts"
---
  def index
    @posts = Post.paginate :page => params[:page],
                           :order => 'created_at DESC',
                           :per_page => 4

INSERT INTO "posts" ("updated_at", "title", "body", "created_at") VALUES('2009-09-18 15:00:35', 'This is a title', 'This is the body of a post', '2009-09-18 15:00:35')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "body" = 'This has to be 100 characters. blah blah blahb labh
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])