app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."nickname" = 'Roy' AND "users"."password" = 'test') LIMIT 1
---
    def login
     if request.post? and params[:user]
       @user = User.new(params[:user])
       if @user.nickname == "admin" && @user.password =="utest123"
         session[:user_id] = "admin"
         flash[:notice] = "Administrator has logged in"
         redirect_to :controller => "users", :action => "index"
       else
         user = User.find_by_nickname_and_password(@user.nickname, @user.password)