app/controllers/users_controller.rb

    def login
     if request.post? and params[:user]
       @user = User.new(params[:user])
       if @user.email == "admin" && @user.password =="utest123"
         session[:user_id] = "admin"
         flash[:notice] = "Administrator has logged in"
         redirect_to :controller => "users", :action => "index"
       else
         user = User.find_by_email_and_password(@user.email, @user.password)
---
SELECT * FROM "users" WHERE ("users"."password" = 'utest' AND "users"."email" = 'chris') LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "updated_at", "nickname", "password", "email", "created_at") VALUES('test', '2009-08-03 17:59:48', 'test', 'test', 'test', '2009-08-03 17:59:48')